<?php
 $array =   [
     'погода' => [
         'Что ожидает нас в ближайший год',
         'Глобальное потепление',
         'Самое большое количество отсадков за последние 50 лет',
         'Снежные вершины'
     ],
     'в мире животных' => [
         'В зоопарке родился носорог',
         '5 маленьких котят ищут новые семьи',
         'Медвеженок Барни существует',
         'Нашествие саранчи привело людей в замешательство'
     ],
     'диология о рыбалке' => [
         'Ловись рыбка большая и мельнкая',
         'Где лучше клюет',
         'Рыбацкие истороии',
         'Русалки существуют'
     ],
     'космос' => [
         'Полетели, полетели на луну не сели',
         'Жили-были в предалеком царстве',
         'Млечный путь',
         ' Скоро звездопар'
     ],
     'Новый год' => [
         'Скоро новый год',
         'Рождество, где провести?',
         'Дедушка мороз заболел',
         'Огромный питомкик живых елочек'
     ]
 ];

 print_r(array_keys($array));
